tap "dracula/install"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "mdogan/zulu"
tap "quarkusio/tap"
brew "bat"
brew "btop"
brew "direnv"
brew "docker-completion"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "fzf"
brew "git"
brew "git-delta"
brew "less"
brew "lima"
brew "lsd"
brew "node@20", link: true
brew "openssh"
brew "ripgrep"
brew "tinyproxy"
brew "unzip"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "quarkusio/tap/quarkus"
cask "devtoys"
cask "dracula-insomnia"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "github"
cask "google-chrome"
cask "hiddenbar"
cask "insomnia"
cask "intellij-idea"
cask "keepassxc"
cask "kitty"
cask "microsoft-edge"
cask "visual-studio-code"
cask "zulu-jdk21"
vscode "angular.ng-template"
vscode "arjun.swagger-viewer"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "christian-kohler.npm-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-vscode-remote.remote-containers"
vscode "naumovs.color-highlight"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-microprofile"
vscode "redhat.vscode-quarkus"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "runem.lit-plugin"
vscode "secanis.jenkinsfile-support"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "ue.alphabetical-sorter"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yzhang.markdown-all-in-one"
